Repository: lawrancej/logisim
Catalog: xlate/ru/doc/omegat-logisim-doc_ru-omegat.tmx
Source language: en
Languages: ru_ru

source: But you may want to increase the number of iterations if you are working with a circuit where Logisim reports false oscillations.
ru_ru: Но вы можете увеличить число итераций, если вы работаете со схемой, где Logisim сообщает о ложных возбуждениях.

source: That is, it does this unless you are moving up or down within the same simulation, in which case the logging module does not change.
ru_ru: То есть оно делает это, если вы не перемещаетесь вверх или вниз в пределах одного моделирования - в этом случае модуль ведения журнала остаётся неизменным.

source: Select input: The value of this input determines which of the outputs is 1.
ru_ru: Выбирающий вход: значение на данном входе определяет, на каком из выходов будет 1.

source: The menu option will be automatically unchecked if circuit oscillation is detected.
ru_ru: Пункт меню будет автоматически отключен, если обнаружено возбуждение схемы.

source: Label
ru_ru: Метка

source: Analyze Circuit
ru_ru: Анализировать схему

source: Each row in the table displays a snapshot of the simulation after a propagation of values has completed.
ru_ru: Каждая строка в таблице показывает снимок моделирования после завершения просчёта значений.

source: This tab includes preferences affecting the appearance of the main window used for Logisim.
ru_ru: На этой вкладке находятся настройки, влияющие на внешний вид главного окна Logisim.

source: The following truth table illustrates.
ru_ru: Это иллюстрирует следующая таблица истинности.

source: T Flip-Flop
ru_ru: T триггер

source: The displayed table is for review only; it is not interactive.
ru_ru: Отображаемая таблица - только для просмотра; она не интерактивна.

source: However, because of the volume of information they can store, they are also two of the most complex components.
ru_ru: Однако, в силу большого объёма информации, которую они могут хранить, они также - два из наиболее сложных компонентов.

source: The location of the output pin relative to the component.
ru_ru: Расположение выходного контакта относительно компонента.

source: Available only when editing a circuit's appearance and a point has been selected on a line, polyline, or polygon, this menu item inserts a new vertex onto the shape.
ru_ru: Этот пункт меню доступен только при редактировании внешнего вида схемы и при условии, что выделена точка на линии, на ломанной, или на многоугольнике. Он вставляет новую вершину в фигуру.

source: At all times, the ASCII value for the leftmost character in the buffer is sent out the rightmost output.
ru_ru: ASCII значение крайнего левого символа буфера постоянно поступает на крайний правый выход.

source: We could execute this circuit directly to get the desired output for a perfect solution.
ru_ru: Мы могли бы выполнить эту схему непосредственно, чтобы получить желаемый результат для идеального решения.

source: Generating a circuit
ru_ru: Создание схемы

source: For example, 11001011 arithmetically shifted right twice is 11110010.
ru_ru: Например, 11001011 арифметически сдвинутое вправо на два - это 11110010.

source: This behavior is necessary to keep with the intuitive behavior of wires in Logisim, where wires never overlap.
ru_ru: Такое поведение необходимо, чтобы сохранить интуитивное поведение проводов в Logisim там, где провода никогда не перекрываются.

source: When you delve into a subcircuit's state via its pop-up menu, the Go Out To State submenu lists the circuits above the currently viewed circuit's state.
ru_ru: Когда вы углубляетесь в состояние подсхемы через её всплывающее меню, подменю Состояние уровнем выше выдаёт список схем выше состояния рассматриваемой схемы.

source: Built-in libraries are libraries that are distributed with Logisim.
ru_ru: Встроенные библиотеки - библиотеки, распространяющиеся с Logisim.

source: Divider
ru_ru: Делитель

source: Steps one tick forward into the simulation.
ru_ru: Продвигает моделирование на один шаг вперёд.

source: Rotate Right: All bits in data are shifted down dist places, with the bottom dist places wrapped around into the top.
ru_ru: Циклический правый: все биты в данные сдвигаются вниз на дистанция позиций, а нижние дистанция позиций прокручиваются вверх.

source: The lower dataBits bits of the difference of the two values coming in the west edge, minus the bin bit.
ru_ru: Младшие битыДанных битов разности двух значений, поступающих на западный край минус бит bin.

source: In the following, the term split end refers to one of the multiple wires on one side, while the term combined end refers to the single wire on the other side.
ru_ru: Далее термин разъединённый конец относится к одному из нескольких проводов на одной стороне, а термин объединённый конец относится к одиночному проводу на другой стороне.

source: Switches to allow you to edit how the circuit will be represented when it is used as a subcircuit within another circuit.
ru_ru: Переключает вас на режим редактирования того, как будет выглядеть схема, когда она используется как подсхема внутри другой схемы.

source: The component's input.
ru_ru: Вход компонента.

source: Enable: When 0, the multiplexer's output consists of all floating bits, regardless of the data and select inputs.
ru_ru: Разрешить: когда 0, на всех битах выхода мультиплексора плавающие значения, независимо от входа данных и выбирающего входа.

source: For components that can take a label but have none assigned to it currently, you can click anywhere within the component to add a label.
ru_ru: Для компонентов, которые могут иметь метку, но не имеют её в данный момент, вы можете щёлкнуть внутри компонента чтобы добавить метку.

source: Separate load and store ports
ru_ru: Раздельные порты чтения и записи

source: You may copy and distribute the Program (or a work based on it, under Section 2) in object code or executable form under the terms of Sections 1 and 2 above provided that you also do one of the following:
ru_ru: Вы можете копировать и распространять Программу (или произведение, основанное на ней) согласно Разделу 2) в объектном коде или в выполнимом виде в соответствии с Разделами 1 и 2, приведенными выше, при условии, что вы также выполните одно из следующих требований:

source: THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
ru_ru: ДАННОЕ ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ ПРЕДОСТАВЛЯЕТСЯ «КАК ЕСТЬ», БЕЗ ЛЮБОГО ВИДА ГАРАНТИЙ, ЯВНО ВЫРАЖЕННЫХ ИЛИ ПОДРАЗУМЕВАЕМЫХ, ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ ГАРАНТИЯМИ ТОВАРНОЙ ПРИГОДНОСТИ, СООТВЕТСТВИЯ ПО ЕГО КОНКРЕТНОМУ НАЗНАЧЕНИЮ И НЕНАРУШЕНИЯ ПРАВ.

source: For example, suppose we want a circuit that computes the bitwise AND of the two nibbles of its eight-bit input (the upper four bits and the lower four bits).
ru_ru: Например, предположим, что нам нужна схема, которая вычисляет побитовое И между двумя частями её восьмибитного входа (старшими четырьмя битами и младшими четырьмя битами).

source: A multi-bit NOT gate will perform the above transformation bitwise on its input.
ru_ru: Многобитный элемент НЕ будет выполнять указанные выше преобразования над значением на входе поразрядно.

source: The index of the desired bit, counting from 0 for the lowest-order bit.
ru_ru: Номер желаемого бита, считая младший бит нулевым.

source: If we had mutable instance
ru_ru: Если бы мы имели изменяемые переменные экземпляра,

source: Orange: The components attached to the wire do not agree in bit width.
ru_ru: Оранжевый: Компоненты, присоединённые к проводу, не согласованы по разрядности.

source: Gates: Components that perform simple logic functions.
ru_ru: Элементы: компоненты, которые выполняют простые логические функции.

source: Allows the label associated with the component to be edited.
ru_ru: Позволяет редактировать привязанную к компоненту метку.

source: Library:
ru_ru: Библиотека:

source: The range of counting can be configured using the Maximum Value attribute.
ru_ru: Диапазон счёта можно настроить с помощью атрибута Максимальное значение.

source: The next value r2 is computed from r1 using the same computation, and so forth.
ru_ru: Следующее значение r2 вычисляется из r1, используя те же вычисления, и так далее.

source: Displays a window containing the version number, mixed among the splash screen graphics.
ru_ru: Отображает окно, содержащее номер версии, совмещённый с графикой заставки.

source: Action On Overflow
ru_ru: Действие при переполнении

source: User's Guide
ru_ru: Руководство пользователя

source: /* This is how we can set up the attributes for GrayIncrementers.
ru_ru: /* Так мы можем устанавливать атрибуты для GrayIncrementer'ов.

source: Clock: At the instant that this is triggered as specified by the Trigger attribute, the component may advance the stages or load new values.
ru_ru: Тактовый вход: в момент срабатывания этого входа, как указано в атрибуте Срабатывание, компонент может сдвинуть ступени или загрузить новые значения.

source: Shift-clicking ensures that the vertex is at a 45° angle from the previous one.
ru_ru: Щелчок с Shift обеспечивает, что вершина находится под углом, кратным 45° относительно предыдущей.

source: For example, after 0000 comes 0001, in which the final bit has been toggled, so the final bit is underlined.
ru_ru: Например, после 0000 идет 0001, в котором последний бит был переключен, поэтому последний бит подчёркнут.

source: Configures which translation to use.
ru_ru: Задаёт какой перевод использовать.

source: In constructing Boolean expressions corresponding to a circuit, Logisim will first attempt to construct a Boolean expressions corresponding exactly to the gates in the circuit.
ru_ru: При составлении логических выражений, соответствующих схеме, Logisim сначала попытается построить логические выражения, в точности соответствующие элементам на схеме.

source: Read Enable - when 1 (or floating or error), a clock edge will consume the leftmost character from the buffer.
ru_ru: Разрешение чтения - когда значение равно 1 (или плавающее, или ошибка), срабатывание тактового входа считает левый символ из буфера.

source: Matrix Columns
ru_ru: Столбцы матрицы

source: The resistor has just one pin, which is an output and has a bit width that is derived from whichever component it is connected.
ru_ru: Резистор имеет всего один контакт, являющийся выходом, и имеющий разрядность, определяемую компонентом, к которому он подключен.

source: The numbers in italics at left display memory addresses, written in hexadecimal.
ru_ru: Числа, выделенные курсивом слева, отображают адреса памяти, записанные в шестнадцатеричной форме.

source: Print...
ru_ru: Печать...

source: They will not actually be ``dropped'' into the circuit until you either move the selection or change the selection so that the components are no longer in it.
ru_ru: Они не будут фактически "сброшены" в схему, пока вы или не переместите выделение, или не измените выделение так, чтобы эти компоненты не были в нём.

source: Do you still want to know more?
ru_ru: Вы все ещё хотите знать больше?

source: Creating circuits
ru_ru: Создание схем

source: Total page count
ru_ru: Общее количество страниц

source: Controls the bottom horizontal segment.
ru_ru: Управляет нижним горизонтальным сегментом.

source: Dragging a selection can lead to unexpected behavior from wires: If you drag a selection including some wires on top of some other wires, all wires are merged, and the merged wires are placed into the selection.
ru_ru: Перемещение выделения может привести к неожиданному поведению проводов: если вы перетащите выделение, содержащее провода, поверх других проводов, то все провода будут соединены и помещены в выделение.

source: Chip select: This input enables or disables the entire RAM module, based on whether the value is 1/floating or 0.
ru_ru: Выбор кристалла: этот вход включает или выключает весь модуль ОЗУ, в зависимости от того, 1/плавающее значение на нём, или 0.

source: Direction
ru_ru: Направление

source: XOR/XNOR/Odd Parity/Even Parity Gate
ru_ru: Элементы Исключающее ИЛИ/Исключающее ИЛИ-НЕ/Нечётность/Чётность

source: (On Mac OS systems, this will appear as Quit in the Logisim menu.)
ru_ru: (На системах с Mac OS появится как Quit в меню Logisim.)

source: The length of time within each cycle that the clock's output should be 1.
ru_ru: Отрезок времени внутри каждого цикла, в течение которого на выходе должна быть 1.

source: Here, we'll draw
ru_ru: Здесь мы будем рисовать

source: Which it performs depends on the input labeled ld: 1 (or floating) indicates to load the data at the address designated on the component's west side, and 0 indicates to store the data given on the port.
ru_ru: Что он осуществляет, зависит от значения на входе, отмеченном ld: 1 (или плавающее значение) означает чтение данных по адресу, поданному на западный край компонента, а 0 означает запись данных, поступивших на порт.

source: The attribute table is for viewing and displaying a component's attribute values.
ru_ru: Таблица атрибутов служит для просмотра и отображения значений атрибутов компонента.

source: The "Program", below, refers to any such program or work, and a "work based on the Program" means either the Program or any derivative work under copyright law: that is to say, a work containing the Program or a portion of it, either verbatim or with modifications and/or translated into another language.
ru_ru: В последующем термин "Программа" относится к любой такой программе или произведению, а термин "произведение, основанное на Программе" означает Программу или любое произведение, содержащее Программу или ее часть, дословную, или модифицированную, и/или переведенную на другой язык.

source: Facing
ru_ru: Направление

source: The inputs are lined along the component's west edge, with one multibit input for each row of the matrix.
ru_ru: Входы расположены вдоль западного края компонента; один многобитный вход для каждой строки матрицы.

source: Creating expressions
ru_ru: Создание выражений

source: Seed
ru_ru: Семя

source: Splitters
ru_ru: Разветвители

source: This actual tick rate may be much less than the selected tick rate, because Logisim cannot simulate larger circuits at a very fast rate.
ru_ru: Эта фактическая скорость тактов может быть намного меньше, чем вы бранная тактовая частота, потому что Logisim не может моделировать большие схем с очень большой скоростью.

source: East edge, labeled = (output, bit width 1)
ru_ru: Восточный край, отмечен = (выход, разрядность равна 1)

source: West edge, middle pin (input, bit width matches Data Bits attribute)
ru_ru: Западный край, средний контакт (вход, разрядность соответствует атрибуту Биты данных)

source: Count: When this is 1 or unconnected, the value in the counter increments whenever the clock input is triggered - or it decrements if the load input happens to also be 1.
ru_ru: Счёт: когда на этом входе 1, или он не подключен, значение счётчика увеличивается, когда срабатывает тактовый вход, или уменьшается, если на входе load тоже была 1.

source: The default name of the circuit in a newly created file ("main") has no significance at all, and you can feel free to delete or rename that circuit.
ru_ru: Название схемы по умолчанию в заново созданном файле ("main") вообще не имеет никакого значения, и вы можете смело удалить или переименовать эту схему.

source: The length of time within each cycle that the clock's output should be 0.
ru_ru: Отрезок времени внутри каждого цикла, в течение которого на выходе должен быть 0.

source: If Zero or One, the additional bits are 0 or 1 accordingly.
ru_ru: Если Ноль или Единица, то дополнительные биты будут 0 или 1 соответственно.

source: This section discusses application preferences; project options are described in another section.
ru_ru: В этом разделе рассматриваются настройки приложения; параметры проекта описаны в другом разделе.

source: * anything.
ru_ru: * что-то.

source: This will have an effect only if the circuit contains any clock devices (in the Wiring library).
ru_ru: Это будет иметь эффект только тогда, когда схема содержит тактовые генераторы (из библиотеки Проводка).

source: This menu item is usually disabled since you will usually be editing the layout anyway.
ru_ru: Этот пункт меню обычно недоступен, поскольку как правило вы и так редактируете чертёж.

source: Pull Behavior
ru_ru: Обращение с плавающими

source: One of the five possible shift types as outlined above (Logical Left, Logical Right, Arithmetic Right, Rotate Left, Rotate Right).
ru_ru: Один из пяти возможных типов сдвига, как описано выше (Логический левый, Логический правый, Арифметический правый, Циклический левый, Циклический правый).

source: Despite its name, it can either split a multi-bit value into component parts, or it can combine component parts into a multi-bit value - or indeed it can do both at once.
ru_ru: Несмотря на свое название, он может или разделить многобитное значение на составные части, или объединить отдельные части в многобитное значение - или даже может сделать и то и другое сразу.

source: (as already discussed)
ru_ru: (уже обсуждался)

source: Attributes
ru_ru: Атрибуты

source: The presence in the selection of all component(s) contained by the rectangle will be toggled.
ru_ru: Присутствие/отсутствие в выделении всех компонентов, находящихся в прямоугольнике, будет переключено.

source: Allows the text appearing within the label to be edited.
ru_ru: Позволяет редактировать текст, содержащийся в метке.

source: Data Bits
ru_ru: Биты данных

source: Keyboard
ru_ru: Клавиатура

source: When the cursor is over a point that receives a wire, a small green circle will be drawn around it.
ru_ru: Когда курсор над точкой, несущей провод, маленький зелёный кружок будет нарисован вокруг неё.

source: Demonstrates a complete, fairly sophisticated component with which the user can interact.
ru_ru: Демонстрирует полный, довольно сложный компонент, с которым пользователь может взаимодействовать.

source: Wiring library
ru_ru: Библиотека Проводка

source: East edge, labeled Q (output, bit width matches Data Bits attribute)
ru_ru: Восточный край, отмечен Q (выход, разрядность соответствует атрибуту Биты данных)

source: Shift-drag to create a circle, and alt-drag to create the oval starting from the center.
ru_ru: Перетащите с Shift, чтобы создать круг, или с Alt, чтобы создать овал, начиная с его центра.

source: If the selection overlaps several objects, it is lowered only to be below the highest one; select the menu item repeatedly until it is in the order it should be.
ru_ru: Если выделение перекрывает несколько объектов, то оно опускается только ниже самого верхнего из них; используйте этот пункт меню несколько раз подряд, пока объект не окажется в нужном месте.

source: Logisim circuits are easier to design, but they cannot support sophisticated user interaction, and they are relatively inefficient.
ru_ru: Схемы Logisim проще в разработке, но они не могут поддерживать сложные взаимодействия с пользователем, и они относительно неэффективны.

source: Logisim searches for RAM recursively, so this will still work if RAM is nested within a subcircuit.
ru_ru: Logisim ищет ОЗУ рекурсивно, так что это будет работать, даже если ОЗУ вложено в подсхему.

source: And you must show them these terms so they know their rights.
ru_ru: И вы должны показать им эти условия, чтобы они знали о своих правах.

source: This does not affect the number of inputs, which is specified by the Number of Inputs attribute; however, if the number of inputs exceeds 3 (for a narrow component) or 5 (for a wide component), then the gate will be drawn with "wings" to be able to accommodate the number of inputs requested.
ru_ru: Это не влияет на количество входов, которое определяется атрибутом Количество входов; правда, если количество входов превышает 3 (для узкого компонента) или 5 (для широкого), то элемент будет отрисовываться с "крыльями", чтобы вместить запрошенное количество входов.

source: Logisim will not permit removing a vertex on a polygon with only three vertices or on a polyline with only two vertices.
ru_ru: Logisim не позволит удалить вершину из многоугольника с тремя вершинами или из ломанной с двумя вершинами.

source: You can see that Logisim now stands ready to add NAND gates into the circuit.
ru_ru: Вы видите, что Logisim теперь готов добавить элемент И-НЕ в схему.

source: The arrow keys change the Facing attribute for all components in the selection that have such an attribute.
ru_ru: Клавиши со стрелками меняют атрибут Направление для всех компонентов в выделении, которые имеют этот атрибут.

source: If either of the operands contains some floating bits or some error bits, then the component's outputs will be either entirely floating or entirely error values.
ru_ru: Если какой-либо операнд содержит несколько плавающих битов или несколько битов с ошибкой, то на выходах компонента все биты будут плавающими или с ошибкой.

source: This class name should be provided by whoever distributed the JAR file to you.
ru_ru: Это имя класса должно быть предоставлено тем, кто распространяет этот JAR файл.

source: Normally this is off, and Logisim displays the on-screen circuit with indications of the current circuit state, and it displays some hints about component interface (most notably, it draws legs on OR gates to indicate where they would connect).
ru_ru: Как правило этот пункт отключен, и Logisim показывает схемы на экране с отображением текущего состояния схемы и выводит некоторые подсказки связанные с интерфейсом компонентов (самое заметное - он отрисовывает ножки элементов ИЛИ чтобы показать, где они должны присоединяться).

source: The color with which to draw the display's background (transparent by default).
ru_ru: Цвет, которым отрисовывается фон индикатора (по умолчанию прозрачный).

source: This input should have as many bits as is the minimum number to indicate any shift distance from 0 up to one less than Data Bits; that is, it should be the ceiling of the base-2 logarithm of Data Bits.
ru_ru: Этот вход должен иметь столько битов, каково минимальное число для указания любой дистанции сдвига от 0 до значения, на единицу меньшего, чем значение атрибута Биты данных; то есть число битов, равное логарифму по основанию 2 от значения атрибута Биты данных, округлённому вверх до ближайшего целого.

source: If the circuit is too large for the page, the image will be scaled down to fit.
ru_ru: Если схема слишком велика для страницы, изображение будет уменьшено чтобы уместиться.

source: Arithmetic library
ru_ru: Библиотека Арифметика

source: The inputs are lined along the component's south edge, with one multibit input for each column of the matrix.
ru_ru: Входы расположены вдоль южного края компонента; один многобитный вход для каждого столбца матрицы.

source: Should you switch back to the simulation again, it will remember the configuration for that simulation, but you will need to re-enable the file logging manually.
ru_ru: Если вы вернётесь к предыдущему моделированию снова, он "вспомнит" настройки для этого моделирования, но вам нужно будет снова вручную включить запись журнала в файл.

source: One asynchronous load/store port
ru_ru: Один асинхронный порт чтения/записи

source: * several additional features beyond the SimpleGrayCounter class.
ru_ru: * некоторые дополнительные возможности по сравнению с классом SimpleGrayCounter.

source: JAR libraries
ru_ru: Библиотеки JAR

source: The first line identifies the file format used (currently, there is only one file format recognized).
ru_ru: Первая строка определяет используемый формат (в настоящее время есть только один распознаваемый формат).
